tea/cmtyii/tea/b2b/models/Order.php

    public static function getCount()
    {
        $model = self::find()
            ->andWhere(['shoper_id' => Yii::$app->session->get('shoper_id')])
            ->andWhere(['store_id' => Yii::$app->session->get('store_id')]);
        $count = $model->count();
---
SELECT COUNT(*) FROM `t_order` WHERE (`shoper_id`=1) AND (`store_id`=29)